LEXICON_OTHER = {
    "hello": "Привет, я помогу тебе с отправкой постов в твои каналы",
    "other_answer": "Этот бот не для переписки, нужно выбрать действие",
}

LEXICON_POST = {
    "post_start": "Вы в разделе постов, выберите дейстиятие",
    "add_post": "Отправте пост, он может являться текстом, фотографией, "
                "видео или кружком.",
    "coise_date": "Выберите дату отправки поста. Дата не может быть в прошлом.",
    "post_error": "Нужно отправить текст, фото, видео или кружок.",
    "post_choise_add or not": "Нужно отправить текст, фото, видео или кружок.",
    "created_post_choise": "При нажатии на кнопку далее, будет создана "
                            "рассылка для выбранных каналов.\n"
                            "Дата рассылки: ",
    "created_post_message": "Рассылка создана",
}

LEXICON_CHANNEL = {
    "channel_start": "Вы в разделе каналов",
    "add_channel_name": "Введите название канала",
    "channel_name_added": "добавлен.\nВыберите дальнейшее действие",
    "channel_name_error": "Нужно написать текстом название канала.",
}
