LEXICON_OTHER = {
    "hello": "привет, я помогу тебе с отправкой постов в твои каналы",
    "hello_main_menu": "Вы в главном меню, выберите действие",
    "other_answer": "Этот бот не для переписки, нужно выбрать действие",
}

LEXICON_CHANNEL = {
    "channel_start": "Вы в разделе каналов",
    "add_channel_name": "Введите название канала",
    "channel_name_added": "добавлен.\nВыберите дальнейшее действие",
    "channel_name_error": "Нужно написать текстом название канала.",
    "channel_name_exist": "Канал с таким названием уже существует.",
    "channel_no_admin": "Вы не являетесь администратором канала.",
    "not_found_channel": "Канал не найден.",
}

LEXICON_POST = {
    "post_start": "Вы в разделе постов, выберите дейстиятие",
    "add_post": "Отправте пост, он может являться текстом, фотографией, "
                "видео или кружком.",
    "choise_date": "Выберите дату отправки. Если дата в прошлом, то отправка "
                   "сообщения будет в следующем месяце.",
    "choise_date_error": "Дата не может быть в прошлом! Выберите дату.",
    "post_error": "Нужно отправить текст, фото, видео или кружок.",
    "post_choise_add or not": "Нужно отправить текст, фото, видео или кружок.",
    "created_post_choise": "Ваши дальнейшие действия?",
    "created_post_message": "Рассылка создана",
    "channel_list_to_post": "Теперь выберите каналы для публикации.\nПосле "
                            "нажатия кнопки  далее, будет создана рассылка "
                            "для выбранных каналов.",
    "choise_hour": "Выберите время в часах.",
    "choise_minute": "Выберите время в минутах.",
    "post_choise_add_clear_list": "Необходимо выбрать хотябы 1 канал.",
}
